## Домашнее задание №4

Выполняется работа строго в репозитории `python-dh-hw` в файле `HW4.ipynb`, лежащем в корне репозитория. 

**NB!** Перед выполнением обязательно посмотрите [образец оформления работы](https://github.com/ancatmara/python-for-dh/blob/master/Homeworks/HW_example.ipynb).

#### Задание №1 

1. Возьмите текст любой англоязычный текст (художественное произведение, статью, научный текст -- что угодно). Он должен быть сохранен отдельным файлом.
2. Очистите его от пунктуации и приведите к нижнему регистру. Разбейте на биграммы и на триграммы с помощью NLTK. Напечатайте по 20 самых частотных биграмм и триграмм.
3. Лемматизируйте текст и запишите в новый файл. Проверьте, выполняется ли здесь закон Ципфа. Для этого постройте линейную диаграмму, где по оси Х будет ранг (порядковый номер) слова в частотном словаре, а по оси Y - относительная частота (не ipm, просто абсолютная частота, деленая на количество слов в тексте).
4. Очистите текст от стоп-слов. Постройте barplot для 30 самых частотных слов. Эти слова должны быть по оси Х в виде подписей к делениям. Значениями по этой оси будет ряд чисел от 1 до 30.

После решения задач необходимо выложить решение в Github и проверить, что вы видите ваше решение по ссылке ```https://github.com/*ваш username на github*/python-dh-hw/blob/master/HW4.ipynb```

**NB!** В этом и в следующих заданиях коммиты следует делать через консольный интерфейс, а сообщения коммитов должны быть осмысленными. Перед началом работы обязательно повторите Cеминар 1, где описан порядок работы с GitHub.
